YJunction_test1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           polyBoundaryMesh;
    location        "constant/polyMesh";
    object          boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4 // entry0
(
    PipeWalls
    {
        type            wall;
        nFaces          16662;
        startFace       214403;
    }
    inlet1
    {
        type            patch;
        nFaces          152;
        startFace       231065;
    }
    inlet2
    {
        type            patch;
        nFaces          152;
        startFace       231217;
    }
    outlet
    {
        type            patch;
        nFaces          168;
        startFace       231369;
    }
)


// ************************************************************************* //
